-- Заполняют данными из примера.

INSERT INTO product_prices (city, product, cost, date)
VALUES 
('Москва', 'Банан', 55, '2024-01-01'),
('Москва', 'Банан', 60, '2024-01-02'),
('Москва', 'Банан', 58, '2024-01-03'),
('Москва', 'Яблоко', 35, '2024-01-01'),
('Москва', 'Яблоко', 35, '2024-01-02'),
('Москва', 'Вода', 90, '2024-01-01'),
('Москва', 'Вода', 90, '2024-01-02'),
('Москва', 'Вода', 100, '2024-01-03'),
('Самара', 'Банан', 50, '2024-01-02'),
('Самара', 'Банан', 44, '2024-01-03'),
('Самара', 'Хлеб', 40, '2024-01-01'),
('Самара', 'Хлеб', 40, '2024-01-02'),
('Самара', 'Хлеб', 40, '2024-01-03'),
('Киров', 'Вода', 70, '2024-01-01'),
('Киров', 'Вода', 69, '2024-01-02'),
('Киров', 'Вода', 70, '2024-01-03'),
('Киров', 'Мороженное', 90, '2024-01-01'),
('Киров', 'Мороженное', 95, '2024-01-02'),
('Киров', 'Мороженное', 92, '2024-01-03');